bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/TINY/ATTINY104.xml
            <value-group caption="" name="ANALOG_ADC_PRESCALER">
                <value caption="2" name="VAL_0x00" value="0x00"/>
                <value caption="2" name="VAL_0x01" value="0x01"/>
                <value caption="4" name="VAL_0x02" value="0x02"/>
                <value caption="8" name="VAL_0x03" value="0x03"/>
                <value caption="16" name="VAL_0x04" value="0x04"/>
                <value caption="32" name="VAL_0x05" value="0x05"/>
                <value caption="64" name="VAL_0x06" value="0x06"/>
                <value caption="128" name="VAL_0x07" value="0x07"/>
            </value-group>
            <value-group caption="" name="ANALOG_ADC_AUTO_TRIGGER_T10">
                <value caption="Free Running mode" name="VAL_0x00" value="0x00"/>
                <value caption="Analog Comparator" name="VAL_0x01" value="0x01"/>
                <value caption="External Interrupt Request 0" name="VAL_0x02" value="0x02"/>
                <value caption="Timer/Counter0 Compare Match A" name="VAL_0x03" value="0x03"/>
                <value caption="Timer/Counter0 Overflow" name="VAL_0x04" value="0x04"/>
                <value caption="Timer/Counter0 Compare Match B" name="VAL_0x05" value="0x05"/>
                <value caption="Pin Change Interrupt 0 Request" name="VAL_0x06" value="0x06"/>
                <value caption="Timer/Counter0 Capture Event" name="VAL_0x07" value="0x07"/>
            </value-group>
        </module>
        <module caption="Analog Comparator" name="AC">
            <register-group caption="Analog Comparator" name="AC">
                <register caption="Analog Comparator Control And Status Register A" name="ACSRA" offset="0x1F" size="1">
                    <bitfield caption="Analog Comparator Disable" mask="0x80" name="ACD"/>
                    <bitfield caption="Analog Comparator Bandgap enable" mask="0x40" name="ACBG"/>
                    <bitfield caption="Analog Compare Output" mask="0x20" name="ACO"/>
                    <bitfield caption="Analog Comparator Interrupt Flag" mask="0x10" name="ACI"/>
                    <bitfield caption="Analog Comparator Interrupt Enable" mask="0x08" name="ACIE"/>
                    <bitfield caption="Analog Comparator Input Capture  Enable" mask="0x04" name="ACIC"/>
                    <bitfield caption="Analog Comparator Interrupt Mode Select bits" mask="0x03" name="ACIS"
                              values="ANALOG_COMP_INTERRUPT"/>
                </register>
                <register caption="Analog Comparator Control And Status Register B" name="ACSRB" offset="0x1E" size="1">
                    <bitfield caption="Analog Comparator Output Enable" mask="02" name="ACOE"/>
                    <bitfield caption="Analog Comparator positive input selection bit" mask="01" name="ACPMUX"/>
                </register>
                <register caption="" name="DIDR0" offset="0x17" size="1">
                    <bitfield caption="AIN1 Digital Input Disable" mask="0x02" name="AIN1D"/>
                    <bitfield caption="AIN0 Digital Input Disable" mask="0x01" name="AIN0D"/>
                </register>
            </register-group>
            <value-group caption="" name="ANALOG_COMP_INTERRUPT">
                <value caption="Interrupt on Toggle" name="VAL_0x00" value="0x00"/>
                <value caption="Reserved" name="VAL_0x01" value="0x01"/>
                <value caption="Interrupt on Falling Edge" name="VAL_0x02" value="0x02"/>
                <value caption="Interrupt on Rising Edge" name="VAL_0x03" value="0x03"/>
            </value-group>
        </module>
        <module caption="CPU Registers" name="CPU">
            <register-group caption="CPU Registers" name="CPU">
                <register caption="Configuration Change Protection" name="CCP" offset="0x3C" size="1">
                    <bitfield caption="CCP signature" mask="0xff" name="CCP" rw="RW" values="CPU_CCP"/>
                </register>
                <register caption="Stack Pointer " name="SP" offset="0x3D" size="2" mask="0xFFFF"/>
                <register caption="Status Register" name="SREG" offset="0x3F" size="1">
                    <bitfield caption="Global Interrupt Enable" mask="0x80" name="I"/>
                    <bitfield caption="Bit Copy Storage" mask="0x40" name="T"/>
                    <bitfield caption="Half Carry Flag" mask="0x20" name="H"/>
                    <bitfield caption="Sign Bit" mask="0x10" name="S"/>
                    <bitfield caption="Two's Complement Overflow Flag" mask="0x08" name="V"/>
                    <bitfield caption="Negative Flag" mask="0x04" name="N"/>
                    <bitfield caption="Zero Flag" mask="0x02" name="Z"/>
                    <bitfield caption="Carry Flag" mask="0x01" name="C"/>
                </register>
                <register caption="Clock Main Settings Register" name="CLKMSR" offset="0x37" size="1">
                    <bitfield caption="Clock Main Select Bits" mask="0x03" name="CLKMS"/>
                </register>
                <register caption="Clock Prescale Register" name="CLKPSR" offset="0x36" size="1">
                    <bitfield caption="Clock Prescaler Select Bits" mask="0x0F" name="CLKPS"
                              values="CPU_CLK_PRESCALE_4_BITS_SMALL"/>
                </register>
                <register caption="Oscillator Calibration Value" name="OSCCAL" offset="0x39" size="1" mask="0xFF"/>
                <register caption="Sleep Mode Control Register" name="SMCR" offset="0x3A" size="1">
                    <bitfield caption="Sleep Mode Select Bits" mask="0x0E" name="SM" values="CPU_SLEEP_MODE_3BITS"/>
                    <bitfield caption="Sleep Enable" mask="0x01" name="SE"/>
                </register>
                <register caption="Power Reduction Register" name="PRR" offset="0x35" size="1">
                    <bitfield caption="Power Reduction USART" mask="0x04" name="PRUSART"/>
                    <bitfield caption="Power Reduction ADC" mask="0x02" name="PRADC"/>
                    <bitfield caption="Power Reduction Timer/Counter0" mask="0x01" name="PRTIM0"/>
                </register>
                <register caption="Vcc Level Monitoring Control and Status Register" name="VLMCSR" offset="0x34"
                          size="1">
                    <bitfield caption="VLM Flag" mask="0x80" name="VLMF"/>
                    <bitfield caption="VLM Interrupt Enable" mask="0x40" name="VLMIE"/>
                    <bitfield caption="Trigger Level of Voltage Level Monitor bits" mask="0x07" name="VLM"/>
                </register>
                <register caption="Reset Flag Register" name="RSTFLR" offset="0x3B" size="1">
                    <bitfield caption="Watchdog Reset Flag" mask="0x08" name="WDRF"/>
                    <bitfield caption="External Reset Flag" mask="0x02" name="EXTRF"/>
                    <bitfield caption="Power-on Reset Flag" mask="0x01" name="PORF"/>
                </register>
                <register caption="Non-Volatile Memory Control and Status Register" name="NVMCSR" offset="0x32"
                          size="1">
                    <bitfield caption="Non-Volatile Memory Busy" mask="0x80" name="NVMBSY"/>
                </register>
                <register caption="Non-Volatile Memory Command" name="NVMCMD" offset="0x33" size="1" mask="0x3F"/>
            </register-group>
