bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/TINY/ATTINY104.xml
            <value-group caption="CCP signature select" name="CPU_CCP">
                <value caption="SPM Instruction Protection" name="SPM" value="0xE7"/>
                <value caption="IO Register Protection" name="IOREG" value="0xD8"/>
            </value-group>
            <value-group caption="" name="CPU_CLK_PRESCALE_4_BITS_SMALL">
                <value caption="1" name="VAL_0x00" value="0x00"/>
                <value caption="2" name="VAL_0x01" value="0x01"/>
                <value caption="4" name="VAL_0x02" value="0x02"/>
                <value caption="8" name="VAL_0x03" value="0x03"/>
                <value caption="16" name="VAL_0x04" value="0x04"/>
                <value caption="32" name="VAL_0x05" value="0x05"/>
                <value caption="64" name="VAL_0x06" value="0x06"/>
                <value caption="128" name="VAL_0x07" value="0x07"/>
                <value caption="256" name="VAL_0x08" value="0x08"/>
            </value-group>
            <value-group caption="Sleep Mode" name="CPU_SLEEP_MODE_3BITS">
                <value caption="Idle" name="IDLE" value="0x00"/>
                <value caption="ADC Noise Reduction" name="ADC" value="0x01"/>
                <value caption="Power Down" name="PDOWN" value="0x02"/>
                <value caption="Reserved" name="VAL_0x03" value="0x03"/>
                <value caption="Standby" name="STDBY" value="0x04"/>
                <value caption="Reserved" name="VAL_0x05" value="0x05"/>
                <value caption="Reserved" name="VAL_0x06" value="0x06"/>
                <value caption="Reserved" name="VAL_0x07" value="0x07"/>
            </value-group>

        </module>
        <module caption="I/O Port" name="PORT">
            <register-group caption="I/O Port" name="PORTB">
                <register caption="Port Control Register" name="PORTCR" offset="0x16" size="1">
                    <bitfield caption="Break-Before-Make Mode Enable for PORTB" mask="0x02" name="BBMB"/>
                </register>
                <register caption="Pull-up Enable Control Register for PORTB" name="PUEB" offset="0x07" size="1"
                          mask="0x0F"/>
                <register caption="Data Direction Register, Port B" name="DDRB" offset="0x05" size="1" mask="0x0F"/>
                <register caption="Input Pins, Port B" name="PINB" offset="0x04" size="1" mask="0x0F"/>
                <register caption="Port B Data register" name="PORTB" offset="0x06" size="1" mask="0x0F"/>
            </register-group>
            <register-group caption="I/O Port" name="PORTA">
                <register caption="Port Control Register" name="PORTCR" offset="0x16" size="1">
                    <bitfield caption="Break-Before-Make Mode Enable for PORTA" mask="0x01" name="BBMA"/>
                </register>
                <register caption="Pull-up Enable Control Register for PORTA" name="PUEA" offset="0x03" size="1"
                          mask="0xFF"/>
                <register caption="Data Direction Register, Port A" name="DDRA" offset="0x01" size="1" mask="0xFF"/>
                <register caption="Input Pins, Port A" name="PINA" offset="0x00" size="1" mask="0xFF"/>
                <register caption="Port A Data register" name="PORTA" offset="0x02" size="1" mask="0xFF"/>
            </register-group>
        </module>
        <module caption="External Interrupts" name="EXINT">
            <register-group caption="External Interrupts" name="EXINT">
                <register caption="External Interrupt Control Register A" name="EICRA" offset="0x15" size="1">
                    <bitfield caption="Interrupt Sense Control 0 Bit 1" mask="0x02" name="ISC01"/>
                    <bitfield caption="Interrupt Sense Control 0 Bit 0" mask="0x01" name="ISC00"/>
                </register>
                <register caption="External Interrupt Mask register" name="EIMSK" offset="0x13" size="1">
                    <bitfield caption="External Interrupt Request 0 Enable" mask="0x01" name="INT0"/>
                </register>
                <register caption="External Interrupt Flag register" name="EIFR" offset="0x14" size="1">
                    <bitfield caption="External Interrupt Flag 0" mask="0x01" name="INTF0"/>
                </register>
                <register caption="Pin Change Interrupt Control Register" name="PCICR" offset="0x12" size="1">
                    <bitfield caption="Pin Change Interrupt Enable 1" mask="0x02" name="PCIE1"/>
                    <bitfield caption="Pin Change Interrupt Enable 0" mask="0x01" name="PCIE0"/>
                </register>
                <register caption="Pin Change Interrupt Flag Register" name="PCIFR" offset="0x11" size="1">
                    <bitfield caption="Pin Change Interrupt Flag 1" mask="0x02" name="PCIF1"/>
                    <bitfield caption="Pin Change Interrupt Flag 0" mask="0x01" name="PCIF0"/>
                </register>
                <register caption="Pin Change Mask Register 1" name="PCMSK1" offset="0x10" size="1" mask="0x0F">
                    <bitfield caption="Pin Change Enable Mask 1 Bit 3" mask="0x08" name="PCINT11"/>
                    <bitfield caption="Pin Change Enable Mask 1 Bit 2" mask="0x04" name="PCINT10"/>
                    <bitfield caption="Pin Change Enable Mask 1 Bit 1" mask="0x02" name="PCINT9"/>
                    <bitfield caption="Pin Change Enable Mask 1 Bit 0" mask="0x01" name="PCINT8"/>
                </register>
                <register caption="Pin Change Mask Register 0" name="PCMSK0" offset="0x0F" size="1" mask="0xFF">
                    <bitfield caption="Pin Change Enable Mask 0 Bit 7" mask="0x80" name="PCINT7"/>
                    <bitfield caption="Pin Change Enable Mask 0 Bit 6" mask="0x40" name="PCINT6"/>
                    <bitfield caption="Pin Change Enable Mask 0 Bit 5" mask="0x20" name="PCINT5"/>
                    <bitfield caption="Pin Change Enable Mask 0 Bit 4" mask="0x10" name="PCINT4"/>
                    <bitfield caption="Pin Change Enable Mask 0 Bit 3" mask="0x08" name="PCINT3"/>
                    <bitfield caption="Pin Change Enable Mask 0 Bit 2" mask="0x04" name="PCINT2"/>
                    <bitfield caption="Pin Change Enable Mask 0 Bit 1" mask="0x02" name="PCINT1"/>
                    <bitfield caption="Pin Change Enable Mask 0 Bit 0" mask="0x01" name="PCINT0"/>
                </register>
            </register-group>
        </module>
        <module caption="Timer/Counter, 16-bit" name="TC16">
            <register-group caption="Timer/Counter, 16-bit" name="TC0">
                <register caption="Timer/Counter 0 Control Register A" name="TCCR0A" offset="0x2E" size="1">
                    <bitfield caption="Compare Output Mode for Channel A bits" mask="0xC0" name="COM0A"/>
                    <bitfield caption="Compare Output Mode for Channel B bits" mask="0x30" name="COM0B"/>
                    <bitfield caption="Waveform Generation Mode" mask="0x03" name="WGM0"/>
                </register>
                <register caption="Timer/Counter 0 Control Register B" name="TCCR0B" offset="0x2D" size="1">
                    <bitfield caption="Input Capture Noise Canceler" mask="0x80" name="ICNC0"/>
                    <bitfield caption="Input Capture Edge Select" mask="0x40" name="ICES0"/>
                    <bitfield caption="Waveform Generation Mode" mask="0x18" name="WGM0" lsb="2"/>
                    <bitfield caption="Clock Select" mask="0x07" name="CS0" values="CLK_SEL_3BIT_EXT"/>
                </register>
                <register caption="Timer/Counter 0 Control Register C" name="TCCR0C" offset="0x2C" size="1">
                    <bitfield caption="Force Output Compare for Channel A" mask="0x80" name="FOC0A"/>
                    <bitfield caption="Force Output Compare for Channel B" mask="0x40" name="FOC0B"/>
                </register>
